// Данные для модального окна
const productData = {
  'flour': {
    title: 'Масложировая продукция - Ассортимент',
    products: [
      {
        name: 'Масло',
        specs: 'Нерафинированное, 0.5л',
        img: 'img/масло/МАСЛО_0,5_НЕРАФ.jpg'
      },
      {
        name: 'Масло',
        specs: 'Рафинированное дезодорированное высший сорт, 0.5л',
        img: 'img/масло/МАСЛО_0,5_РДВ.jpg'
      },
      {
        name: 'Масло',
        specs: 'Без запаха, 0.8л',
        img: 'img/масло/МАСЛО_0,8л БЕЗ ЗАПАХА.jpg'
      },
      {
        name: 'Масло',
        specs: 'Без запаха, 0.9л',
        img: 'img/масло/МАСЛО_0,9л БЕЗ ЗАПАХА.jpg'
      },
      {
        name: 'Масло',
        specs: 'Без запаха рафинированное дезодорированное, 1.8л',
        img: 'img/масло/МАСЛО_1,8.jpg'
      },
      {
        name: 'Масло',
        specs: 'Без запаха рафинированное дезодорированное, 1л',
        img: 'img/масло/МАСЛО_1л.jpg'
      },
      {
        name: 'Масло',
        specs: 'Кукурузное, рафинированное дезодорированное',
        img: 'img/масло/МАСЛО_КУКУРУЗНОЕ.jpg'
      },
      {
        name: 'Масло',
        specs: 'Ароматное, Нерафинированное, 500мл',
        img: 'img/масло/МАСЛО_МИНИ_АРОМАТНОЕ.jpg'
      },
      {
        name: 'Масло',
        specs: 'Премиум, 1л',
        img: 'img/масло/МАСЛО_ПРЕМИУМ.jpg'
      },
      {
        name: 'Масло',
        specs: 'Для фритюра и жарки, 10л',
        img: 'img/test2.jpg'
      },
    ]
  },
  'maslo': {
    title: 'Овощная консервация - Ассортимент',
    products: [
      {
        name: 'Горошек Зеленый',
        specs: 'Высший сорт, 400г',
        img: 'img/овощи/ГОРОШЕК_стекло.jpg'
      },
      {
        name: 'Грибы Шиитаке',
        specs: 'Консервированные',
        img: 'img/овощи/ГРИБЫ_ШИИТАКЕ.jpg'
      },
      {
        name: 'Баклажаны',
        specs: 'По-гречески, 710г',
        img: 'img/овощи/ЗАКУСКА_БАКЛАЖАНЫ.jpg'
      },
      {
        name: 'Фасоль в томатном соусе',
        specs: 'Белая, 425г',
        img: 'img/овощи/ФАСОЛЬ_БЕЛАЯ В ТОМАТЕ.jpg'
      },
      {
        name: 'Халапеньо',
        specs: 'Резанный, 3кг',
        img: 'img/овощи/ХАЛАПЕНЬО_ЖБ_3 КГ.jpg'
      },
      {
        name: 'Халапеньо',
        specs: 'Резанный, 350г',
        img: 'img/овощи/ХАЛАПЕНЬО_стек_340.jpg'
      },
      {
        name: 'Хреновина',
        specs: '350г',
        img: 'img/овощи/ХРЕНОВИНА_350.jpg'
      },
      {
        name: 'Хреновина',
        specs: '500г',
        img: 'img/овощи/ХРЕНОВИНА_стекло.jpg'
      },
      {
        name: 'Шампиньоны',
        specs: 'Резанные, 3кг',
        img: 'img/овощи/ШАМПИНЬОНЫ_3 copy.jpg'
      },
      {
        name: 'Шампиньоны',
        specs: 'Маринованные, 314г',
        img: 'img/овощи/ШАМПИНЬОНЫ_3 copy.jpg'
      },
      {
        name: 'Корнишоны',
        specs: 'Маринованные, 500г',
        img: 'img/овощи/доп/ОГУРЦЫ_КОРНИШОНЫ_500.jpg'
      },
      {
        name: 'Огурцы',
        specs: 'Маринованные, 670г',
        img: 'img/овощи/доп/ОГУРЦЫ_маринован.jpg'
      },
      {
        name: 'Оливки',
        specs: 'Без косточки, 340г',
        img: 'img/овощи/доп/ОЛИВКИ_без кост 340г стб.jpg'
      },
      {
        name: 'Оливки',
        specs: 'Без косточки, 3кг',
        img: 'img/овощи/доп/ОЛИВКИ_бк_3 КГ.jpg'
      },
      {
        name: 'Маслины',
        specs: 'Без косточки, 300г',
        img: 'img/овощи/доп/МАСЛИНЫ.jpg'
      },
      {
        name: 'Маслины',
        specs: 'Без косточки, стекл.банка, 300г',
        img: 'img/овощи/доп/МАСЛИНЫ_СТЕКЛО_без кост.jpg'
      },
      {
        name: 'Маслины',
        specs: 'С косточкой, 300г',
        img: 'img/овощи/доп/МАСЛИНЫ_с косточ.jpg'
      },
      {
        name: 'Маслины',
        specs: 'Отборные, резаные, 3100г',
        img: 'img/овощи/доп/МАСЛИНЫ_резаные.jpg'
      },
      {
        name: 'Маслины',
        specs: 'Без косточки, 280г',
        img: 'img/овощи/доп/МАСЛИНЫ_БЕЗ КОСТ  280г г НОВАЯ ЭТ..jpg'
      },
      {
        name: 'Маслины',
        specs: 'Без косточки, 3000г',
        img: 'img/овощи/доп/Маслины б. к 3 кг Донская Кухня.jpg'
      },
      {
        name: 'Маслины',
        specs: 'С косточкой, крупные, 3000г',
        img: 'img/овощи/доп/test3.jpg'
      },
      {
        name: 'Маслины',
        specs: 'Резаные, 3000г',
        img: 'img/овощи/доп/Маслины резанные 3 кг Донская Кухня_1.jpg'
      },
    ]
  },
  'test': {
    title: 'Мясная консервация - Ассортимент',
    products: [
      {
        name: 'Ветчина тушеная',
        specs: '340г',
        img: 'img/мясная/ТУШЕНКА_ВЕТЧИНА_ЖБ.jpg'
      },
      {
        name: 'Говядина тушеная',
        specs: '340г',
        img: 'img/мясная/ТУШЕНКА_ГОВЯДИНА_ЖБ.jpg'
      },
      {
        name: 'Говядина тушеная',
        specs: 'Люкс, 340г',
        img: 'img/мясная/ТУШЕНКА_ЛЮКС_ГОВЯДИНА_ЖБ copy.jpg'
      },
      {
        name: 'Свинина тушеная',
        specs: '340г',
        img: 'img/мясная/ТУШЕНКА_СВИНАЯ_ЖБ.jpg'
      },
      {
        name: 'Цыпленок тушеный',
        specs: '340г',
        img: 'img/мясная/ТУШЕНКА_ЦЫПЛЕНОК_ЖБ.jpg'
      }
    ]
  },
  'margarine': {
    title: 'Майонез - Ассортимент',
    products: [
      {
        name: 'Майонез',
        specs: 'Провансаль, 67%, 200мл',
        img: 'img/майонез/МАЙОНЕЗ_ДОЙ ПАК_200 мл.jpg'
      },
     {
        name: 'Майонез',
        specs: 'Провансаль, 67%, 400мл',
        img: 'img/майонез/МАЙОНЕЗ_ДОЙ ПАК_400 мл.jpg'
      },
     {
        name: 'Майонез XXL',
        specs: 'Провансаль, 67%, 700мл',
        img: 'img/майонез/майонез_xxl.jpg'
      },
      {
        name: 'Майонез',
        specs: 'Провансаль, 67%, 900мл',
        img: 'img/майонез/майонез_900.jpg'
      },
      {
        name: 'Майонез',
        specs: 'Провансаль, 78%, 3л',
        img: 'img/майонез/майонез_3л.jpg'
      },
      {
        name: 'Майонез',
        specs: 'Провансаль, 67%, 5л',
        img: 'img/майонез/майонез_5л.jpg'
      },
      {
        name: 'Майонез',
        specs: 'Провансаль, 56%, 10л',
        img: 'img/майонез/майонез_10л.jpg'
      },
      {
        name: 'Майонез',
        specs: 'Провансаль, 40%, 10л',
        img: 'img/майонез/майонез_10л_2.jpg'
      }
    ]
  },
  'fish': {
    title: 'Рыбная консервация - Ассортимент',
    products: [
      {
        name: 'Горбуша',
        specs: '250г',
        img: 'img/рыба/ГОРБУША.jpg'
      },
      {
        name: 'Килька',
        specs: 'Балтийская, в томатном соусе, 240г',
        img: 'img/рыба/РЫБА_ЖБ_КИЛЬКА В ТОМАТЕ.jpg'
      },
      {
        name: 'Печень трески',
        specs: '230г',
        img: 'img/рыба/РЫБА_ЖБ_ПЕЧЕНЬ ТРЕСКИ_банка №5.jpg'
      },
      {
        name: 'Сардина',
        specs: 'С добавление масла, 240г',
        img: 'img/рыба/РЫБА_ЖБ_САРДИНА.jpg'
      },
      {
        name: 'Скумбрия',
        specs: 'Атлантическая, с добавление масла, 240г',
        img: 'img/рыба/РЫБА_ЖБ_СКУМБРИЯ.jpg'
      },
      {
        name: 'Сардина Иваси',
        specs: 'Тихоокеанская, с добавление масла, 240г',
        img: 'img/рыба/РЫБА_ИВАСИ.jpg'
      },
      {
        name: 'Сайра',
        specs: 'Тихоокеанская, с добавление масла, 240г',
        img: 'img/рыба/САЙРА.jpg'
      },
      {
        name: 'Тунец',
        specs: 'Натуральный, 240г',
        img: 'img/рыба/ТУНЕЦ.jpg'
      },
    ]
  },
  'confectionery': {
    title: 'Кондитерское сырьё - Ассортимент',
    products: [
      {
        name: 'Мука',
        specs: 'Пшеничная высший сорт, 2кг',
        img: 'img/кондитер/МУКА_2кг.jpg'
      },
      {
        name: 'Сахар',
        specs: 'Кусковый, 1кг',
        img: 'img/кондитер/САХАР_1 кг.jpg'
      },
      {
        name: 'Сахар',
        specs: 'Кусковый, 500г',
        img: 'img/кондитер/САХАР_МИНИ.jpg'
      }
    ]
  },
  'dairy': {
    title: 'Молочная продукция - Ассортимент',
    products: [
      {
        name: 'Молоко',
        specs: '3,2%, 1л',
        img: 'img/молоко/МОЛОКО_1л.jpg'
      },
      {
        name: 'Сгущенное молоко',
        specs: 'С сахаром, 270г',
        img: 'img/молоко/СГУЩ_ДОЙ ПАК.jpg'
      },
      {
        name: 'Сгещенное молоко',
        specs: 'Цельное, с сахаром, в банке',
        img: 'img/молоко/СГУЩЕННОЕ_ГОСТ_ЖБ.jpg'
      },
      {
        name: 'Сгещенное молоко',
        specs: 'С сахаром, в банке',
        img: 'img/молоко/СГУЩЕННОЕ_ЖБ.jpg'
      }
    ]
  },
  'groceries': {
    title: 'Бакалея - Ассортимент',
    products: [
      {
        name: 'Овсяные хлопья',
        specs: 'Экстра, 1кг',
        img: 'img/бакалея/ЭКСТРА (1).jpg'
      },
    ]
  },
    'Angel': {
    title: 'Angel - Ассортимент',
    products: [
      {
        name: 'Улучшитель',
        specs: 'Хлебопекарный, LD-500, 10кг',
        img: 'img/angel/ANGEL улучшитель хлебопекарный LD-500  10кг.jpg'
      },
      {
        name: 'Дрожжи',
        specs: 'Сухие, инстантные, 500гр',
        img: 'img/angel/дрожжи.jpg'
      },
      {
        name: 'Дрожжи',
        specs: 'Сухие, для сдобного теста, инстантные, 500гр',
        img: 'img/angel/дрожжи2.jpg'
      },
      {
        name: 'Дрожжи',
        specs: 'Сухие, инстантные, 500гр',
        img: 'img/angel/дрожжи3.jpg'
      },
      {
        name: 'Дрожжи',
        specs: 'Сухие, для лепешек, инстантные, 500гр',
        img: 'img/angel/дрожжи4.jpg'
      }
    ]
  },
  'fruit': {
    title: 'Фруктовая консервация - Ассортимент',
    products: [
      {
        name: 'Груши',
        specs: 'Отборные половинки, 3100мл',
        img: 'img/фрукты/fr-p-500.webp'
      },
      {
        name: 'Вишня',
        specs: 'Коктельная в сиропе, 720мл',
        img: 'img/фрукты/fr6-p-500.webp'
      },
      {
        name: 'Клубника',
        specs: 'В сиропе отборная, 425мл',
        img: 'img/фрукты/fr1-p-500.webp'
      },
      {
        name: 'Манго',
        specs: 'Отборное, 425мл',
        img: 'img/фрукты/fr2-p-500.webp'
      },
      {
        name: 'Персики',
        specs: 'Отборные половинки, 850мл',
        img: 'img/фрукты/fr3-p-500.webp'
      },
      {
        name: 'Персики',
        specs: 'Отборные половинки, 3100мл',
        img: 'img/фрукты/fr3-p-500.webp'
      },
      {
        name: 'Ананасы',
        specs: 'Консервированные колечки, 580мл',
        img: 'img/фрукты/fr4-p-500.webp'
      },
      {
        name: 'Ананасы',
        specs: 'Консервированные колечки, 850мл',
        img: 'img/фрукты/fr4-p-500.webp'
      },
      {
        name: 'Ананасы',
        specs: 'Консервированные колечки, 3100мл',
        img: 'img/фрукты/fr5-p-500.webp'
      },
    ]
  },
  'sou': {
    title: 'Соусы - Ассортимент',
    products: [
      {
        name: 'Кетчуп',
        specs: 'Томатный, шашлычный, 350г',
        img: 'img/соусы/кетчуп-p-500.webp'
      },
      {
        name: 'Томатная паста',
        specs: '800мл',
        img: 'img/соусы/томатная-паста-p-500.webp'
      },
      {
        name: 'Уксус',
        specs: '9%, 500мл',
        img: 'img/соусы/уксус-p-500.webp'
      },
    ]
  },
  'grandpro': {
    title: 'GRANDPRO - Ассортимент',
    products: [
      {
        name: 'Маргарин',
        specs: 'Твердый, для выпечки, марка MT, 82%, 10кг',
        img: 'img/Grand_Pro/margarin.jpg'
      },
      {
        name: 'Маргарин',
        specs: 'Твердый, для кремов, марка MTК, 84%, 10кг',
        img: 'img/Grand_Pro/margarin2.jpg'
      },
      {
        name: 'Маргарин',
        specs: 'Твердый, для песочных изделий, марка MT, 82%, 10кг',
        img: 'img/Grand_Pro/margarin3.jpg'
      },
      {
        name: 'Маргарин',
        specs: 'Твердый, для слоеных изделий, марка MTС, 82%, 10кг',
        img: 'img/Grand_Pro/margarin4.jpg'
      },
    ]
  },
  'solpro': {
    title: 'SolPro - Ассортимент',
    products: [
      {
        name: 'Маргарин',
        specs: 'Для выпечки, твердый, столовый, молочный, с ароматом, 20кг',
        img: 'img/SolPro/margarin_solpro.jpeg'
      },
      {
        name: 'Маргарин',
        specs: 'Универсальный, твердый, столовый, 75%, 20кг',
        img: 'img/SolPro/margarin_solpro2.jpeg'
      },
      {
        name: 'Маргарин',
        specs: 'Для кремов, твердый, марка МТК, 84%, 20кг',
        img: 'img/SolPro/margarin_solpro3.jpeg'
      },
      {
        name: 'Маргарин',
        specs: 'Для песочных изделий, твердый, марка МТ, 82%, 20кг',
        img: 'img/SolPro/margarin_solpro4.jpeg'
      },
      {
        name: 'Маргарин',
        specs: 'Для слоёный изделий, твердый, марка МТС, с пергаментом, 10кг',
        img: 'img/SolPro/margarin_solpro5.jpeg'
      },
      {
        name: 'Масло',
        specs: 'Для фритюра, раф.дез, 5л',
        img: 'img/SolPro/масло_1.jpeg'
      }
    ]
  },
};